; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos) 
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key) 
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key) 
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    pos0-0 pos0-1 pos0-2 pos0-3 pos0-4 pos1-0 pos1-1 pos1-2 pos1-3 pos1-4 pos2-0 pos2-1 pos2-2 pos2-3 pos2-4 pos3-0 pos3-1 pos3-2 pos3-3 pos3-4 pos4-0 pos4-1 pos4-2 pos4-3 pos4-4
    shape0 shape1 shape2
    key0 key1 key2 key3
    )

    (:init
       (arm-empty)

       (place pos0-0)
       (place pos0-1)
       (place pos0-2)
       (place pos0-3)
       (place pos0-4)
       (place pos1-0)
       (place pos1-1)
       (place pos1-2)
       (place pos1-3)
       (place pos1-4)
       (place pos2-0)
       (place pos2-1)
       (place pos2-2)
       (place pos2-3)
       (place pos2-4)
       (place pos3-0)
       (place pos3-1)
       (place pos3-2)
       (place pos3-3)
       (place pos3-4)
       (place pos4-0)
       (place pos4-1)
       (place pos4-2)
       (place pos4-3)
       (place pos4-4)
       (shape shape0)
       (shape shape1)
       (shape shape2)
       (key key0)
       (key key1)
       (key key2)
       (key key3)

       (conn pos0-0 pos1-0)
       (conn pos0-0 pos0-1)
       (conn pos0-1 pos1-1)
       (conn pos0-1 pos0-2)
       (conn pos0-1 pos0-0)
       (conn pos0-2 pos1-2)
       (conn pos0-2 pos0-3)
       (conn pos0-2 pos0-1)
       (conn pos0-3 pos1-3)
       (conn pos0-3 pos0-4)
       (conn pos0-3 pos0-2)
       (conn pos0-4 pos1-4)
       (conn pos0-4 pos0-3)
       (conn pos1-0 pos2-0)
       (conn pos1-0 pos1-1)
       (conn pos1-0 pos0-0)
       (conn pos1-1 pos2-1)
       (conn pos1-1 pos1-2)
       (conn pos1-1 pos0-1)
       (conn pos1-1 pos1-0)
       (conn pos1-2 pos2-2)
       (conn pos1-2 pos1-3)
       (conn pos1-2 pos0-2)
       (conn pos1-2 pos1-1)
       (conn pos1-3 pos2-3)
       (conn pos1-3 pos1-4)
       (conn pos1-3 pos0-3)
       (conn pos1-3 pos1-2)
       (conn pos1-4 pos2-4)
       (conn pos1-4 pos0-4)
       (conn pos1-4 pos1-3)
       (conn pos2-0 pos3-0)
       (conn pos2-0 pos2-1)
       (conn pos2-0 pos1-0)
       (conn pos2-1 pos3-1)
       (conn pos2-1 pos2-2)
       (conn pos2-1 pos1-1)
       (conn pos2-1 pos2-0)
       (conn pos2-2 pos3-2)
       (conn pos2-2 pos2-3)
       (conn pos2-2 pos1-2)
       (conn pos2-2 pos2-1)
       (conn pos2-3 pos3-3)
       (conn pos2-3 pos2-4)
       (conn pos2-3 pos1-3)
       (conn pos2-3 pos2-2)
       (conn pos2-4 pos3-4)
       (conn pos2-4 pos1-4)
       (conn pos2-4 pos2-3)
       (conn pos3-0 pos4-0)
       (conn pos3-0 pos3-1)
       (conn pos3-0 pos2-0)
       (conn pos3-1 pos4-1)
       (conn pos3-1 pos3-2)
       (conn pos3-1 pos2-1)
       (conn pos3-1 pos3-0)
       (conn pos3-2 pos4-2)
       (conn pos3-2 pos3-3)
       (conn pos3-2 pos2-2)
       (conn pos3-2 pos3-1)
       (conn pos3-3 pos4-3)
       (conn pos3-3 pos3-4)
       (conn pos3-3 pos2-3)
       (conn pos3-3 pos3-2)
       (conn pos3-4 pos4-4)
       (conn pos3-4 pos2-4)
       (conn pos3-4 pos3-3)
       (conn pos4-0 pos4-1)
       (conn pos4-0 pos3-0)
       (conn pos4-1 pos4-2)
       (conn pos4-1 pos3-1)
       (conn pos4-1 pos4-0)
       (conn pos4-2 pos4-3)
       (conn pos4-2 pos3-2)
       (conn pos4-2 pos4-1)
       (conn pos4-3 pos4-4)
       (conn pos4-3 pos3-3)
       (conn pos4-3 pos4-2)
       (conn pos4-4 pos3-4)
       (conn pos4-4 pos4-3)
       (locked pos1-3)
       (locked pos3-3)
       (locked pos2-3)
       (locked pos0-4)
       (lock-shape  pos1-3 shape0)
       (lock-shape  pos3-3 shape1)
       (lock-shape  pos2-3 shape2)
       (lock-shape  pos0-4 shape2)
       (open pos0-0)
       (open pos0-1)
       (open pos0-2)
       (open pos0-3)
       (open pos1-0)
       (open pos1-1)
       (open pos1-2)
       (open pos1-4)
       (open pos2-0)
       (open pos2-1)
       (open pos2-2)
       (open pos2-4)
       (open pos3-0)
       (open pos3-1)
       (open pos3-2)
       (open pos3-4)
       (open pos4-0)
       (open pos4-1)
       (open pos4-2)
       (open pos4-3)
       (open pos4-4)

       (key-shape  key0 shape0)
       (key-shape  key1 shape1)
       (key-shape  key2 shape2)
       (key-shape  key3 shape2)
       (at key0 pos2-1)
       (at key1 pos4-0)
       (at key2 pos0-0)
       (at key3 pos3-0)
       (at-robot pos4-4)
    )

    (:goal (and
       (at key0 pos3-0)
       (at key1 pos4-1)
       (at key2 pos3-2)
       (at key3 pos2-1)
    ))
(:constraints
  (always (not (at-robot pos2-0)))
)
)

; plan
1. (move pos4-4 pos4-3)
   deleted: (at-robot pos4-4)
   added: (at-robot pos4-3)
   goals met: 0 of 4
2. (move pos4-3 pos4-2)
   deleted: (at-robot pos4-3)
   added: (at-robot pos4-2)
   goals met: 0 of 4
3. (move pos4-2 pos4-1)
   deleted: (at-robot pos4-2)
   added: (at-robot pos4-1)
   goals met: 0 of 4
4. (move pos4-1 pos4-0)
   deleted: (at-robot pos4-1)
   added: (at-robot pos4-0)
   goals met: 0 of 4
5. (pickup pos4-0 key1)
   deleted: (at key1 pos4-0) (arm-empty)
   added: (holding key1)
   goals met: 0 of 4
6. (move pos4-0 pos4-1)
   deleted: (at-robot pos4-0)
   added: (at-robot pos4-1)
   goals met: 0 of 4
7. (putdown pos4-1 key1)
   deleted: (holding key1)
   added: (arm-empty) (at key1 pos4-1)
   goals met: 1 of 4
8. (move pos4-1 pos3-1)
   deleted: (at-robot pos4-1)
   added: (at-robot pos3-1)
   goals met: 1 of 4
9. (move pos3-1 pos3-0)
   deleted: (at-robot pos3-1)
   added: (at-robot pos3-0)
   goals met: 1 of 4
10. (pickup pos3-0 key3)
   deleted: (at key3 pos3-0) (arm-empty)
   added: (holding key3)
   goals met: 1 of 4
11. (move pos3-0 pos3-1)
   deleted: (at-robot pos3-0)
   added: (at-robot pos3-1)
   goals met: 1 of 4
12. (move pos3-1 pos2-1)
   deleted: (at-robot pos3-1)
   added: (at-robot pos2-1)
   goals met: 1 of 4
13. (pickup-and-loose pos2-1 key0 key3)
   deleted: (holding key3) (at key0 pos2-1)
   added: (holding key0) (at key3 pos2-1)
   goals met: 2 of 4
14. (move pos2-1 pos2-2)
   deleted: (at-robot pos2-1)
   added: (at-robot pos2-2)
   goals met: 2 of 4
15. (move pos2-2 pos3-2)
   deleted: (at-robot pos2-2)
   added: (at-robot pos3-2)
   goals met: 2 of 4
16. (move pos3-2 pos3-1)
   deleted: (at-robot pos3-2)
   added: (at-robot pos3-1)
   goals met: 2 of 4
17. (move pos3-1 pos3-0)
   deleted: (at-robot pos3-1)
   added: (at-robot pos3-0)
   goals met: 2 of 4
18. (putdown pos3-0 key0)
   deleted: (holding key0)
   added: (arm-empty) (at key0 pos3-0)
   goals met: 3 of 4
19. (move pos3-0 pos3-1)
   deleted: (at-robot pos3-0)
   added: (at-robot pos3-1)
   goals met: 3 of 4
20. (move pos3-1 pos2-1)
   deleted: (at-robot pos3-1)
   added: (at-robot pos2-1)
   goals met: 3 of 4
21. (move pos2-1 pos1-1)
   deleted: (at-robot pos2-1)
   added: (at-robot pos1-1)
   goals met: 3 of 4
22. (move pos1-1 pos0-1)
   deleted: (at-robot pos1-1)
   added: (at-robot pos0-1)
   goals met: 3 of 4
23. (move pos0-1 pos0-0)
   deleted: (at-robot pos0-1)
   added: (at-robot pos0-0)
   goals met: 3 of 4
24. (pickup pos0-0 key2)
   deleted: (at key2 pos0-0) (arm-empty)
   added: (holding key2)
   goals met: 3 of 4
25. (move pos0-0 pos0-1)
   deleted: (at-robot pos0-0)
   added: (at-robot pos0-1)
   goals met: 3 of 4
26. (move pos0-1 pos0-2)
   deleted: (at-robot pos0-1)
   added: (at-robot pos0-2)
   goals met: 3 of 4
27. (move pos0-2 pos1-2)
   deleted: (at-robot pos0-2)
   added: (at-robot pos1-2)
   goals met: 3 of 4
28. (move pos1-2 pos2-2)
   deleted: (at-robot pos1-2)
   added: (at-robot pos2-2)
   goals met: 3 of 4
29. (move pos2-2 pos3-2)
   deleted: (at-robot pos2-2)
   added: (at-robot pos3-2)
   goals met: 3 of 4
30. (putdown pos3-2 key2)
   deleted: (holding key2)
   added: (arm-empty) (at key2 pos3-2)
   goals met: 4 of 4
